package week6.HomeWork.LaptopShop2;

/**
 * Created by Дмитрий on 04.03.14.
 *
 * Дополнить магазин ноутбуков следующими функциями:
 1. Выводить отчет об остатках отдельно по изготовителю, объему оперативной памяти, размеру экрана, кол-ву на складе.
 2. Выводить отчет о списании за указанный период. В отчет входит: номер партии, тип, цена, дата приема.
 3. Оформить нового покупателя (id, фамилия, имя, отчество, телефон, объем покупок)
 4. Оформить нового продавца (id, фамилия, имя, отчество, объем продаж, зарплата)
 5. Уволить продавца
 6. Продать ноутбук/ноутбуки
 7. Вывести отчет о продажах за период (дата, покупатель, продавец, сумма)
 */
public class LaptopShopBeta {
}
