package hw8.taxi.service;

/**
 * Created by Дмитрий on 15.03.14.

 Реализовать авторизацию пользователя системы (оператора). Пользователь вводит:
 - логин (должен быть не менее 4 символов, не должен содержать пробелы)
 - идентификационный номер (10 цифр, без букв и других знаков)
 - пароль и его подтверждение (должен быть не менее 8 символов, включать большие и маленькие буквы, цифры, должен совпадать с подтверждением)
 - пользователь с таким логином должен быть уникальным

 Класс задания hw8.taxi.service.AuthorizationService
 */
public class AuthorizationService {
}
