package hw8.taxi.service;

/**
 * Created by Дмитрий on 15.03.14.

 Оператор вводит логин и пароль.
 Если пароль с логином не совпадает то повторить ввод.
 Колличество попыток ввода задается в properties файле. После последней неудачной попытки пользователь блокируется.
 Время действия пароля задается в properties файле
 После истечения действия пароля, пользователь должен поменять пароль. Предыдущий вводить нельзя

 Класс задания hw8.taxi.service.AuthenticationService
 */
public class AuthenticationService {
}
